# NaN

### 准备

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### NaN at Series

In [2]:
n1 = np.nan

In [3]:
n1

nan

In [4]:
type(n1)

float

In [5]:
5 + n1

nan

In [6]:
s1 = Series([1, 2, np.nan, 3, 4], index=['A', 'B', 'C', 'D', 'E'])

In [7]:
s1

A    1.0
B    2.0
C    NaN
D    3.0
E    4.0
dtype: float64

In [8]:
s2 = s1.isnull()

In [9]:
s2

A    False
B    False
C     True
D    False
E    False
dtype: bool

In [10]:
s3 = s1.notnull()

In [11]:
s3

A     True
B     True
C    False
D     True
E     True
dtype: bool

In [12]:
s4 = s1.dropna()

In [13]:
s4

A    1.0
B    2.0
D    3.0
E    4.0
dtype: float64

### NaN at DataFrame

In [46]:
df1 = DataFrame({'Team': {'D.Green': 'SA', 'J.Lin': np.nan, 'R.Gay': 'SA', 'S.Curry': np.nan}, 
                 'Number': {'D.Green': '14', 'J.Lin': np.nan, 'R.Gay': '22', 'S.Curry': np.nan}, 
                 'Position': {'D.Green': 'SG', 'J.Lin': 'PG', 'R.Gay': 'SF', 'S.Curry': np.nan}})

In [47]:
df1

        Team Number Position
D.Green   SA     14       SG
J.Lin    NaN    NaN       PG
R.Gay     SA     22       SF
S.Curry  NaN    NaN      NaN

In [48]:
df1.isnull()

          Team  Number  Position
D.Green  False   False     False
J.Lin     True    True     False
R.Gay    False   False     False
S.Curry   True    True      True

In [49]:
df1.notnull()

          Team  Number  Position
D.Green   True    True      True
J.Lin    False   False      True
R.Gay     True    True      True
S.Curry  False   False     False

In [50]:
df2 = df1.dropna(axis=0)

In [51]:
df2

        Team Number Position
D.Green   SA     14       SG
R.Gay     SA     22       SF

In [52]:
df3 = df1.dropna(axis=1)

In [53]:
df3

Empty DataFrame
Columns: []
Index: [D.Green, J.Lin, R.Gay, S.Curry]

In [54]:
df4 = df1.dropna(axis=0, how='any')

In [55]:
df4

        Team Number Position
D.Green   SA     14       SG
R.Gay     SA     22       SF

In [56]:
df5 = df1.dropna(axis=0, how='all')

In [57]:
df5

        Team Number Position
D.Green   SA     14       SG
J.Lin    NaN    NaN       PG
R.Gay     SA     22       SF

In [98]:
# 保留至少有 n 个非 NaN 数据的行/列
df6 = df1.dropna(thresh=1)

In [99]:
df6

        Team Number Position
D.Green   SA     14       SG
J.Lin    NaN    NaN       PG
R.Gay     SA     22       SF

In [101]:
df7 = df1.fillna(value='No Data')

In [102]:
df7

            Team   Number Position
D.Green       SA       14       SG
J.Lin    No Data  No Data       PG
R.Gay         SA       22       SF
S.Curry  No Data  No Data  No Data

In [ ]:
# ......